---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData
source: html/5411567a-c556-61ec-a41b-182d2277d8a5.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData

The input and output data used by external servers for calculation of the duct fitting and duct accessory pressure drop.

## Syntax (C#)
```csharp
public class DuctFittingAndAccessoryPressureDropData : IDisposable
```